In [28]:
import pandas as pd

In [29]:
pd.read_csv("date.csv")

   Unnamed: 0  coloana1  coloana2  coloana3
0           0        11      88.5     verde
1           1        22      99.0     negru
2           2        33     111.0  albastru
3           3        44     222.0       mov

# pip install openpyxl

In [30]:
pd.read_excel("date.xlsx")

   Unnamed: 0  coloana1  coloana2
0           0        11        88
1           1        22        99
2           2        33       111
3           3        44       222

In [31]:
df = pd.read_csv("date.csv")
df

   Unnamed: 0  coloana1  coloana2  coloana3
0           0        11      88.5     verde
1           1        22      99.0     negru
2           2        33     111.0  albastru
3           3        44     222.0       mov

In [32]:
df = pd.read_csv("date.csv", index_col=0)
df

   coloana1  coloana2  coloana3
0        11      88.5     verde
1        22      99.0     negru
2        33     111.0  albastru
3        44     222.0       mov

In [33]:
df.describe()

        coloana1    coloana2
count   4.000000    4.000000
mean   27.500000  130.125000
std    14.200939   61.935955
min    11.000000   88.500000
25%    19.250000   96.375000
50%    27.500000  105.000000
75%    35.750000  138.750000
max    44.000000  222.000000

In [34]:
df["coloana4"] = df["coloana2"] > 200
df

   coloana1  coloana2  coloana3  coloana4
0        11      88.5     verde     False
1        22      99.0     negru     False
2        33     111.0  albastru     False
3        44     222.0       mov      True

In [35]:
df.describe()

        coloana1    coloana2
count   4.000000    4.000000
mean   27.500000  130.125000
std    14.200939   61.935955
min    11.000000   88.500000
25%    19.250000   96.375000
50%    27.500000  105.000000
75%    35.750000  138.750000
max    44.000000  222.000000

In [36]:
df.dtypes

coloana1      int64
coloana2    float64
coloana3     object
coloana4       bool
dtype: object

In [37]:
df.keys()

Index(['coloana1', 'coloana2', 'coloana3', 'coloana4'], dtype='object')

In [38]:
df

   coloana1  coloana2  coloana3  coloana4
0        11      88.5     verde     False
1        22      99.0     negru     False
2        33     111.0  albastru     False
3        44     222.0       mov      True

In [39]:
df[ ["coloana3", "coloana4" ]   ]

   coloana3  coloana4
0     verde     False
1     negru     False
2  albastru     False
3       mov      True

In [41]:
df.describe()

        coloana1    coloana2
count   4.000000    4.000000
mean   27.500000  130.125000
std    14.200939   61.935955
min    11.000000   88.500000
25%    19.250000   96.375000
50%    27.500000  105.000000
75%    35.750000  138.750000
max    44.000000  222.000000

In [42]:
df.max()

coloana1       44
coloana2    222.0
coloana3    verde
coloana4     True
dtype: object

In [43]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]})
df2 = pd.DataFrame({'Name': ['Alice', 'Bob', 'David'], 'Salary': [50000, 60000, 70000]})

df1

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [44]:
df2

    Name  Salary
0  Alice   50000
1    Bob   60000
2  David   70000

In [ ]:
m_df = pd.merge(df1, df2, on='Name')
m_df

    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000

In [47]:
df

   coloana1  coloana2  coloana3  coloana4
0        11      88.5     verde     False
1        22      99.0     negru     False
2        33     111.0  albastru     False
3        44     222.0       mov      True

In [48]:
df.head(2)

   coloana1  coloana2 coloana3  coloana4
0        11      88.5    verde     False
1        22      99.0    negru     False

In [49]:
df.tail(2)

   coloana1  coloana2  coloana3  coloana4
2        33     111.0  albastru     False
3        44     222.0       mov      True